ssh/ibatis_nots.org
#+OPTIONS:"\n:t"
ibatis笔记
* 优点
** 易于掌握
** 容易进行sql优化
** 可以进行细粒度的优化
*** 更新表的某个字段不用更新所有字段
 + UPDATE 表名称 SET 列名='值' WHERE 条件
*** 需要列出表的部分内容时,可以少从数据库读数据,节省资源
 + SELECT 列名1,列名2,列名... FROM 表名称 WHERE 条件
*** 更新语句时,执行一条 UPDATE 就可以,无需先 SELECT 提升性能
*** SQL语句都保存在单独的文件中,具有可维护性
*** 运行效率比hibernate高
* 缺点
** 对不同数据库类型的支持差
** cache管理支持差
* 开发实例
** 新建数据表
** 配置文件
+ ibatis必须配置 sql-map-config,文件名随意
 #+BEGIN_SRC xml
   <?xml version="1.0" encoding="UTF-8" ?>
   <!DOCTYPE sqlMapConfig
   PUBLIC "-//iBATIS.com//DTD SQL Map Config 2.0//EN"
   "http://www.ibatis.com/dtd/sql-map-config-2.dtd">
  <sqlMapConfig>
    <settings
      cacheModelsEnabled="true"
      enhancementEnabled="true"
      lazyLoadingEnabled="true"
      maxRequests="32"
      maxSessions="10"
     maxTransactions="5"
     useStatementNamespaces="false"
   />
   <transactionManager type="JDBC" >
     <dataSource type="SIMPLE">
       <property name="JDBC.Driver" value="sun.jdbc.odbc.JdbcOdbcDriver"/>
       <property name="JDBC.ConnectionURL" value="jdbc:odbc:Blog"/>
       <property name="JDBC.Username" value="admin"/>
       <property name="JDBC.Password" value=""/>
      </dataSource>
   </transactionManager>
   <sqlMap resource="Account.xml" />
 </sqlMapConfig>
 #+END_SRC
 + 说明 
  - sqlMapConfig
  - transactionManager
** 关联xml配置文件
#+BEGIN_SRC xml
 <?xml version="1.0" encoding="UTF-8" ?>
<!DOCTYPE sqlMap
  PUBLIC "-//iBATIS.com//DTD SQL Map 2.0//EN"
  "http://www.ibatis.com/dtd/sql-map-2.dtd">
<sqlMap namespace="Account">

  <select id="getAccount" parameterClass="java.lang.String" resultClass="example.Account">
    select * from Account where username = #value#
  </select>

  <insert id="createAccount" parameterClass="example.Account">
    insert into Account (username, password)
    values ( #username#, #password# )
  </insert>
</sqlMap>
#+END_SRC
+ 说明
  - 查询语句用 <select id="" parameterClass="" resultClass="">查询语句</select>
    查询方法为 getAccount
  - 插入语句用 <insert id="" parameterClass="">插入语句</insert> 
    插入方法为 createAccount
