ssh/ibatis_nots.org
** 映射java类
 #+BEGIN_SRC java
 package example;
 public class Account {
    private String username;
    private String password;

    public String getUsername() { return username; }
    public void setUsername(String username) { this.username=username; }

    public String getPassword() { return password; }
    public void setPassword(String password) { this.password=password; }
  }
 #+END_SRC
 + 说明
  - javaBean

** 使用ibatis映射
*** 初始化 ibatis ,获取 SqlMapClient对象
 #+BEGIN_SRC java
  com.ibatis.sqlmap.client.SqlMapClient sqlMap = null;
    try {
        java.io.Reader reader = com.ibatis.common.resources.Resources.getResourceAsReader ("sql-map-config.xml");
        sqlMap = SqlMapClientBuilder.buildSqlMapClient(reader);
    } catch (Exception e) {
        e.printStackTrace();
    }
#+END_SRC
*** 使用映射
 + 查询
#+BEGIN_SRC java
   try {
        Account accout = (Account)sqlMap.queryForObject("getAccount", "admin");
        ...
    }  
 #+END_SRC
+ 插入
#+BEGIN_SRC java
 try {
        Account account = new Account();
        account.setUsername("micheal");
        account.setPassword("1234");
        sqlMap.insert("createAccount", account);
    }
#+END_SRC

* spring与ibatis
** 配置ibatis客户模版
 + ibatis的核心是com.ibatis.sqlmap.client.SqlMapClient
   -执行所有的数据访问操作
 + 存储方法可能抛出java.lang.SQLException,过于泛泛不便使用
 + SqlMapClientTemplate 包裹了一个 SqlMapClient  来透明地操作数据库
*** 配置 SqlMapClientTemplate
 #+BEGIN_SRC xml 
  <bean id="SqlMapClientTemplate" class="org.springframework.orm.ibatis.SqlMapClientTemplate">
    <property name="sqlMapClient" ref="sqlMapClient"/>
  </bean>
  <bean id="SqlMapClient" class="orm.springframework.orm.ibatis.SqlMapClientFactoryBean">
    <property name="dataSource" ref="dataSource"/>
    <property name="cofigLocation" value="sql-map-config.xml"/>  
  </bean>
 #+END_SRC
*** 定义 ibatis sql 映射表
****  映射配置
 #+BEGIN_SRC xml
 <sqlMapConfig>
   <sqlMap resources="配置文件的路径名称"/>
   ....
</sqlMapConfig>
#+END_SRC
****  映射文件
#+BEGIN_SRC xml
 <sqlMap>
  <!--配置结果映射-->
   <resultMap id="" class="">
     <result propety="" column=""/>
   </resultMap>
   <select id="" resultMap="" parameterClass="">
     <![CDATA[
       查询语句在这里
     ]]  
   </select>
 </sqlMap>
#+END_SRC
*** 在dao中使用模板
**** 配置依赖 SqlMapClientTemplate 的 Dao
#+BEGIN_SRC xml
  <bean id="dao名称" class="dao的路径名称">
    <property id="sqlMapClientTemplate" ref="sqlMapClientTemplate"/>
  </bean>
#+END_SRC
**** 使用 SqlMapClientTemplate
 #+BEGIN_SRC java
  public List<Rant> getRantForDay(Date day)
  {
    return sqlMapClientTemplate.queryForList("getRantForDay",day);
  }
#+END_SRC
** 建立基于ibatis的dao
