publish/html/ibatis_nots.html

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4"><span class="section-number-3">3.4</span> 映射java类 </h3>
<div class="outline-text-3" id="text-3.4">


<p><br/>
<pre class="src src-java"><span style="color: #fa8072;">package</span> <span style="color: #7fffd4;">example</span>;
<span style="color: #fa8072;">public</span> <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Account</span> {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">username</span>;
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">password</span>;

   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">getUsername</span>() { <span style="color: #fa8072;">return</span> username; }
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">setUsername</span>(<span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">username</span>) { <span style="color: #fa8072;">this</span>.username=username; }

   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">getPassword</span>() { <span style="color: #fa8072;">return</span> password; }
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">setPassword</span>(<span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">password</span>) { <span style="color: #fa8072;">this</span>.password=password; }
 }
</pre>


</p><ul>
<li>
说明<br/>
<ul>
<li>
javaBean<br/>

<p><br/>
</p></li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.5" class="outline-3">
<h3 id="sec-3.5"><span class="section-number-3">3.5</span> 使用ibatis映射 </h3>
<div class="outline-text-3" id="text-3.5">


</div>

<div id="outline-container-3.5.1" class="outline-4">
<h4 id="sec-3.5.1"><span class="section-number-4">3.5.1</span> 初始化 ibatis ,获取 SqlMapClient对象 </h4>
<div class="outline-text-4" id="text-3.5.1">


<p><br/>
<pre class="src src-java"><span style="color: #7fffd4;">com</span>.<span style="color: #7fffd4;">ibatis</span>.<span style="color: #7fffd4;">sqlmap</span>.<span style="color: #7fffd4;">client</span>.<span style="color: #9acd32; font-weight: bold;">SqlMapClient</span> <span style="color: #7fffd4; font-weight: bold;">sqlMap</span> = <span style="color: #7fffd4;">null</span>;
  <span style="color: #fa8072;">try</span> {
      <span style="color: #7fffd4;">java</span>.<span style="color: #7fffd4;">io</span>.<span style="color: #9acd32; font-weight: bold;">Reader</span> <span style="color: #7fffd4; font-weight: bold;">reader</span> = <span style="color: #7fffd4;">com</span>.<span style="color: #7fffd4;">ibatis</span>.<span style="color: #7fffd4;">common</span>.<span style="color: #7fffd4;">resources</span>.Resources.getResourceAsReader (<span style="color: #ffa07a;">"sql-map-config.xml"</span>);
      sqlMap = SqlMapClientBuilder.buildSqlMapClient(reader);
  } <span style="color: #fa8072;">catch</span> (<span style="color: #9acd32; font-weight: bold;">Exception</span> <span style="color: #7fffd4; font-weight: bold;">e</span>) {
      e.printStackTrace();
  }
</pre>


</p></div>

</div>

<div id="outline-container-3.5.2" class="outline-4">
<h4 id="sec-3.5.2"><span class="section-number-4">3.5.2</span> 使用映射 </h4>
<div class="outline-text-4" id="text-3.5.2">

<ul>
<li>
查询<br/>

<p><br/>
</p></li>
</ul>


<pre class="src src-java"><span style="color: #fa8072;">try</span> {
     <span style="color: #9acd32; font-weight: bold;">Account</span> <span style="color: #7fffd4; font-weight: bold;">accout</span> = (<span style="color: #9acd32; font-weight: bold;">Account</span>)sqlMap.queryForObject(<span style="color: #ffa07a;">"getAccount"</span>, <span style="color: #ffa07a;">"admin"</span>);
     ...
 }  
</pre>


<ul>
<li>
插入<br/>

<p><br/>
</p></li>
</ul>


<pre class="src src-java"><span style="color: #fa8072;">try</span> {
       <span style="color: #9acd32; font-weight: bold;">Account</span> <span style="color: #7fffd4; font-weight: bold;">account</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Account</span>();
       account.setUsername(<span style="color: #ffa07a;">"micheal"</span>);
       account.setPassword(<span style="color: #ffa07a;">"1234"</span>);
       sqlMap.insert(<span style="color: #ffa07a;">"createAccount"</span>, account);
   }
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> spring与ibatis </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1"><span class="section-number-3">4.1</span> 配置ibatis客户模版 </h3>
<div class="outline-text-3" id="text-4.1">

<ul>
<li>
ibatis的核心是com.ibatis.sqlmap.client.SqlMapClient<br/>
-执行所有的数据访问操作<br/>
</li>
<li>
存储方法可能抛出java.lang.SQLException,过于泛泛不便使用<br/>
</li>
<li>
SqlMapClientTemplate 包裹了一个 SqlMapClient  来透明地操作数据库<br/>
</li>
</ul>

</div>

<div id="outline-container-4.1.1" class="outline-4">
<h4 id="sec-4.1.1"><span class="section-number-4">4.1.1</span> 配置 SqlMapClientTemplate </h4>
<div class="outline-text-4" id="text-4.1.1">


<p><br/>
<pre class="src src-xml">&lt;<span style="color: #7fffd4; font-weight: bold;">bean</span> <span style="color: #7fffd4; font-weight: bold;">id</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">SqlMapClientTemplate</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">class</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">org.springframework.orm.ibatis.SqlMapClientTemplate</span><span style="color: #ffa07a;">"</span>&gt;
  &lt;<span style="color: #7fffd4; font-weight: bold;">property</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">sqlMapClient</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">ref</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">sqlMapClient</span><span style="color: #ffa07a;">"</span>/&gt;
&lt;/<span style="color: #7fffd4; font-weight: bold;">bean</span>&gt;
&lt;<span style="color: #7fffd4; font-weight: bold;">bean</span> <span style="color: #7fffd4; font-weight: bold;">id</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">SqlMapClient</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">class</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">orm.springframework.orm.ibatis.SqlMapClientFactoryBean</span><span style="color: #ffa07a;">"</span>&gt;
  &lt;<span style="color: #7fffd4; font-weight: bold;">property</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">dataSource</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">ref</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">dataSource</span><span style="color: #ffa07a;">"</span>/&gt;
  &lt;<span style="color: #7fffd4; font-weight: bold;">property</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">cofigLocation</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">value</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">sql-map-config.xml</span><span style="color: #ffa07a;">"</span>/&gt;  
&lt;/<span style="color: #7fffd4; font-weight: bold;">bean</span>&gt;
</pre>


</p></div>

</div>

<div id="outline-container-4.1.2" class="outline-4">
<h4 id="sec-4.1.2"><span class="section-number-4">4.1.2</span> 定义 ibatis sql 映射表 </h4>
<div class="outline-text-4" id="text-4.1.2">

<ul>
<li id="sec-4.1.2.1">映射配置 <br/>

<p><br/>
<pre class="src src-xml"> &lt;<span style="color: #7fffd4; font-weight: bold;">sqlMapConfig</span>&gt;
   &lt;<span style="color: #7fffd4; font-weight: bold;">sqlMap</span> <span style="color: #7fffd4; font-weight: bold;">resources</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">&#37197;&#32622;&#25991;&#20214;&#30340;&#36335;&#24452;&#21517;&#31216;</span><span style="color: #ffa07a;">"</span>/&gt;
   ....
&lt;/<span style="color: #7fffd4; font-weight: bold;">sqlMapConfig</span>&gt;
</pre>


</p></li>
<li id="sec-4.1.2.2">映射文件 <br/>

<p><br/>
<pre class="src src-xml">&lt;<span style="color: #7fffd4; font-weight: bold;">sqlMap</span>&gt;
 <span style="color: #add8e6;">&lt;!--</span><span style="color: #add8e6;">&#37197;&#32622;&#32467;&#26524;&#26144;&#23556;</span><span style="color: #add8e6;">--&gt;</span>
  &lt;<span style="color: #7fffd4; font-weight: bold;">resultMap</span> <span style="color: #7fffd4; font-weight: bold;">id</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">class</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span>&gt;
    &lt;<span style="color: #7fffd4; font-weight: bold;">result</span> <span style="color: #7fffd4; font-weight: bold;">propety</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">column</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span>/&gt;
  &lt;/<span style="color: #7fffd4; font-weight: bold;">resultMap</span>&gt;
  &lt;<span style="color: #7fffd4; font-weight: bold;">select</span> <span style="color: #7fffd4; font-weight: bold;">id</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">resultMap</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">parameterClass</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">"</span>&gt;
    &lt;![CDATA[
      &#26597;&#35810;&#35821;&#21477;&#22312;&#36825;&#37324;
    ]]  
  &lt;/<span style="color: #7fffd4; font-weight: bold;">select</span>&gt;
&lt;/<span style="color: #7fffd4; font-weight: bold;">sqlMap</span>&gt;
</pre>


</p></li>
</ul>
</div>

</div>

<div id="outline-container-4.1.3" class="outline-4">
<h4 id="sec-4.1.3"><span class="section-number-4">4.1.3</span> 在dao中使用模板 </h4>
<div class="outline-text-4" id="text-4.1.3">

<ul>
<li id="sec-4.1.3.1">配置依赖 SqlMapClientTemplate 的 Dao <br/>

<p><br/>
<pre class="src src-xml">&lt;<span style="color: #7fffd4; font-weight: bold;">bean</span> <span style="color: #7fffd4; font-weight: bold;">id</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">dao&#21517;&#31216;</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">class</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">dao&#30340;&#36335;&#24452;&#21517;&#31216;</span><span style="color: #ffa07a;">"</span>&gt;
  &lt;<span style="color: #7fffd4; font-weight: bold;">property</span> <span style="color: #7fffd4; font-weight: bold;">id</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">sqlMapClientTemplate</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">ref</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">sqlMapClientTemplate</span><span style="color: #ffa07a;">"</span>/&gt;
&lt;/<span style="color: #7fffd4; font-weight: bold;">bean</span>&gt;
</pre>


</p></li>
<li id="sec-4.1.3.2">使用 SqlMapClientTemplate <br/>

<p><br/>
<pre class="src src-java"><span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">List</span>&lt;Rant&gt; getRantForDay(<span style="color: #9acd32; font-weight: bold;">Date</span> <span style="color: #7fffd4; font-weight: bold;">day</span>)
{
  <span style="color: #fa8072;">return</span> sqlMapClientTemplate.queryForList(<span style="color: #ffa07a;">"getRantForDay"</span>,day);
}
</pre>


</p></li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2"><span class="section-number-3">4.2</span> 建立基于ibatis的dao </h3>
<div class="outline-text-3" id="text-4.2">


</div>
